{"version": "https://jsonfeed.org/version/1", "title": "Tart Virtualization", "home_page_url": "https://tart.run/", "feed_url": "https://tart.run/feed_json_updated.json", "description": "Tart is a virtualization toolset to build, run and manage macOS and Linux virtual machines (VMs) on Apple Silicon.\n", "icon": null, "authors": [{"name": "Cirrus Labs"}], "language": "en", "items": [{"id": "https://tart.run/blog/2024/06/20/jumping-through-the-hoops-ssh-jump-host-functionality-in-orchard/", "url": "https://tart.run/blog/2024/06/20/jumping-through-the-hoops-ssh-jump-host-functionality-in-orchard/", "title": "Jumping through the hoops: SSH jump host functionality in Orchard", "content_html": "<h1>Jumping through the hoops: SSH jump host functionality in Orchard</h1>\n<p>Almost a year ago, when we started building <a href=\"https://github.com/cirruslabs/orchard\">Orchard</a>, an orchestration system for Tart, we quickly realized that most worker machines will be in a private network, and that VMs will be only reachable from the worker machines themselves. Thus, one of our goals became to simplify accessing the compute resources in a cluster through a centralized controller host.</p>\n<p>This effort resulted in commands like <code>orchard port-forward</code> and <code>orchard ssh</code>, which were later improved to support connecting not just to the VMs, but to the worker machines themselves.</p>\n<p>Today, we’re making an even further step in this effort: with a trivial configuration, an Orchard controller can act as an SSH jump host to allow connecting to the VMs using just the <code>ssh</code> command like <code>ssh -J &lt;service account name&gt;@orchard-controller.example.com &lt;VM name&gt;</code>!</p>", "image": "https://tart.run/assets/images/social/blog/posts/2024-06-20-jumping-through-the-hoops.png", "date_modified": "2024-06-20T22:39:41+00:00", "authors": [{"name": "edigaryev"}], "tags": null}, {"id": "https://tart.run/blog/2023/02/11/changing-tart-license/", "url": "https://tart.run/blog/2023/02/11/changing-tart-license/", "title": "Changing Tart License", "content_html": "<h1>Changing Tart License</h1>\n<p><strong>TLDR:</strong> We are transitioning Tart's licensing from AGPL-3.0 to <a href=\"https://fair.io/\">Fair Source 100</a>. This change will\npermit unlimited installations on personal computers, but organizations that exceed a certain number of server\ninstallations utilizing 100 CPU cores will be required to obtain a paid license.</p>\n<h2>Background</h2>\n<p>Exactly a year ago on February 11th 2022 we started working on Tart – a tiny CLI to run macOS virtual machines on Apple Silicon.\nThree months later we successfully started using Tart in our own production system and decided to share Tart with everyone.</p>\n<p><img src=\"https://github.com/cirruslabs/tart/raw/main/Resources/TartSocial.png\"/></p>\n<p>The goal was to establish a community of users and contributors to transform Tart from a small CLI to a robust tool\nfor various scenarios. <strong>Unfortunately, we were not successful in attracting a significant number of contributors.</strong>\nIt's important to note that we did have seven individuals who contributed to the development of Tart to the best of\ntheir abilities. However, one of the challenges of contributing to Tart is that the skill set required for a contribution\nis vastly different from the skill set typically possessed by regular Tart users in their daily work. Specifically,\na contributor needs to have knowledge of the Swift programming language, as well as a background in operating systems\nand network stack. This is the reason why <strong>98.8% of the code and all the major features were contributed by Cirrus Labs engineers.</strong></p>", "image": "https://tart.run/assets/images/social/blog/posts/2023-02-11-changing-tart-license.png", "date_modified": "2024-02-23T15:27:30+00:00", "authors": [{"name": "fkorotkov"}], "tags": null}, {"id": "https://tart.run/blog/2023/11/03/new-dashboard-with-insights-into-performance-of-cirrus-runners/", "url": "https://tart.run/blog/2023/11/03/new-dashboard-with-insights-into-performance-of-cirrus-runners/", "title": "New dashboard with insights into performance of Cirrus Runners", "content_html": "<h1>New dashboard with insights into performance of Cirrus Runners</h1>\n<p>This month we are celebrating one year since launching Cirrus Runners — managed Apple Silicon infrastructure for your\nGitHub Actions. During the last 12 months we ran millions of workflows for our customers and now ready to share some insights\ninto price performance of them for our customers.</p>\n<p>One of the key difference with Cirrus Runners is how they are getting billed for. Customers purchase Cirrus Runners via monthly subscription\nthat costs $150 per each Cirrus Runner. Each runner can be used 24 hours a day 7 days a week to run GitHub Actions workflows\nfor an organization. If there are more outstanding jobs than available runners then they are queued and executed as soon as\nthere is a free runner. This is different from how GitHub-managed GitHub Actions are billed for — you pay for each minute of execution time.</p>\n<p>The benefit of a fixed price is that you can run as many jobs as you want without worrying about the cost. The downside is that\nyou need to make sure that you are using your runners efficiently. This is where the new dashboard comes in handy.</p>", "image": "https://tart.run/assets/images/social/blog/posts/2023-11-03-cirrus-runners-dashboard.png", "date_modified": "2023-11-03T08:17:40+00:00", "authors": [{"name": "fkorotkov"}], "tags": null}, {"id": "https://tart.run/blog/2023/10/06/tart-is-now-available-on-aws-marketplace/", "url": "https://tart.run/blog/2023/10/06/tart-is-now-available-on-aws-marketplace/", "title": "Tart is now available on AWS Marketplace", "content_html": "<h1>Tart is now available on AWS Marketplace</h1>\n<p>Announcing <a href=\"https://aws.amazon.com/marketplace/pp/prodview-qczco34wlkdws\">official AMIs for EC2 Mac Instances</a>\nwith preconfigured Tart installation that is optimized to work within AWS infrastructure.</p>\n<p>EC2 Mac Instances is a gem of engineering powered by AWS Nitro devices. Just imagine there is a physical Mac Mini with\na plugged in Nitro device that can push the physical power button!</p>\n<p><img alt=\"EC2 M2 Pro\" src=\"/blog/images/ec2-mac2-m2pro.png\"></p>\n<p>This clever synergy between Apple Hardware and Nitro System allows seamless integration with VPC networking and booting macOS from an EBS volume.</p>\n<p>In this blog post we’ll see how a virtualization solution like Tart can compliment and elevate experience with EC2 Mac Instances.</p>", "image": "https://tart.run/assets/images/social/blog/posts/2023-10-06-tart-on-aws.png", "date_modified": "2023-10-07T08:06:06+00:00", "authors": [{"name": "fkorotkov"}], "tags": null}, {"id": "https://tart.run/blog/2023/04/28/ssh-over-grpc-or-how-orchard-simplifies-accessing-vms-in-private-networks/", "url": "https://tart.run/blog/2023/04/28/ssh-over-grpc-or-how-orchard-simplifies-accessing-vms-in-private-networks/", "title": "SSH over gRPC or how Orchard simplifies accessing VMs in private networks", "content_html": "<h1>SSH over gRPC or how Orchard simplifies accessing VMs in private networks</h1>\n<p>We started developing <a href=\"https://github.com/cirruslabs/orchard\">Orchard</a>, an orchestrator for <a href=\"https://tart.run/\">Tart</a>, with the requirement that it should allow users to access virtual machines running on worker nodes in private networks that users might not have access to.</p>\n<p>At the same time, we wanted to enable users to access VMs on these remote workers just as easily as they’d access network services on their local Tart VMs.</p>\n<p>While these features sound great on paper, they pose a technical problem: how do we connect to the remote workers, let alone VMs running on these workers, if we can’t assume that these workers will be easily reachable? And how do we establish an SSH connection with a VM running on a remote worker through all these hoops?</p>", "image": "https://tart.run/assets/images/social/blog/posts/2023-04-28-orchard-ssh-over-grpc.png", "date_modified": "2023-09-29T07:35:17+00:00", "authors": [{"name": "edigaryev"}], "tags": null}, {"id": "https://tart.run/blog/2023/09/20/tart-200-and-community-updates/", "url": "https://tart.run/blog/2023/09/20/tart-200-and-community-updates/", "title": "Tart 2.0.0 and community updates", "content_html": "<h1>Tart 2.0.0 and community updates</h1>\n<p>Today we'd like to share some news and updates around the Tart ecosystem since the Tart 1.0.0 release back in February.</p>", "image": "https://tart.run/assets/images/social/blog/posts/2023-09-20-tart-2.0.0.png", "date_modified": "2023-09-29T07:35:17+00:00", "authors": [{"name": "fkorotkov"}], "tags": null}, {"id": "https://tart.run/blog/2023/04/25/announcing-orchard-orchestration-for-managing-macos-virtual-machines-at-scale/", "url": "https://tart.run/blog/2023/04/25/announcing-orchard-orchestration-for-managing-macos-virtual-machines-at-scale/", "title": "Announcing Orchard orchestration for managing macOS virtual machines at scale", "content_html": "<h1>Announcing Orchard orchestration for managing macOS virtual machines at scale</h1>\n<p>Today we are happy to announce general availability of Orchard – our new orchestrator to manage Tart virtual machines at scale.\nIn this post we’ll cover the motivation behind creating yet another orchestrator and why we didn’t go with Kubernetes or Nomad integration.</p>\n<h2>What problem are we trying to solve?</h2>\n<p>After releasing Tart we pretty quickly started getting requests about managing macOS virtual machines on a cluster of\nApple Silicon machines rather than just a single host which only allows a maximum of two virtual machines at a time.\nBy the end of 2022 the requests reached a tipping point, and we started planning.</p>", "image": "https://tart.run/assets/images/social/blog/posts/2023-04-25-orchard-ga.png", "date_modified": "2023-04-28T15:52:02+00:00", "authors": [{"name": "fkorotkov"}], "tags": null}]}